zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_MISC.h
/*
** ###################################################################
**     Processors:          MCXW70ACMFT
**                          MCXW70ACMMP
**                          MCXW70ADMFT
**                          MCXW70ADMMP
**
**     Version:             rev. 1.0, 2026-01-09
**     Build:               b260813
**
**     Abstract:
**         CMSIS Peripheral Access Layer for XCVR_MISC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2026-01-09)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file PERI_XCVR_MISC.h
 * @version 1.0
 * @date 2026-01-09
 * @brief CMSIS Peripheral Access Layer for XCVR_MISC
 *
 * CMSIS Peripheral Access Layer for XCVR_MISC
 */

#if !defined(PERI_XCVR_MISC_H_)
#define PERI_XCVR_MISC_H_                        /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXW70ACMFT) || defined(CPU_MCXW70ACMMP))
#include "MCXW70AC_COMMON.h"
#elif (defined(CPU_MCXW70ADMFT) || defined(CPU_MCXW70ADMMP))
#include "MCXW70AD_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- XCVR_MISC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XCVR_MISC_Peripheral_Access_Layer XCVR_MISC Peripheral Access Layer
 * @{
 */

/** XCVR_MISC - Size of Registers Arrays */
#define XCVR_MISC_IPS_FO_ADDRX_COUNT              8u
#define XCVR_MISC_IPS_FO_DRS0_DATAX_COUNT         8u
#define XCVR_MISC_IPS_FO_DRS1_DATAX_COUNT         8u

/** XCVR_MISC - Register Layout Typedef */
typedef struct {
  __IO uint32_t XCVR_CTRL;                         /**< TRANSCEIVER CONTROL, offset: 0x0 */
  __IO uint32_t XCVR_STATUS;                       /**< TRANSCEIVER STATUS, offset: 0x4 */
  __IO uint32_t FAD_CTRL;                          /**< FAD CONTROL, offset: 0x8 */
  __IO uint32_t DMA_CTRL;                          /**< TRANSCEIVER DMA CONTROL, offset: 0xC */
  __IO uint32_t DBG_RAM_CTRL;                      /**< DBG Ram control register, offset: 0x10 */
  __IO uint32_t DBG_RAM_ADDR;                      /**< DBG RAM ADDRESS, offset: 0x14 */
  __I  uint32_t DBG_RAM_STOP_ADDR;                 /**< DBG RAM STOP ADDRESS, offset: 0x18 */
  __IO uint32_t LDO_TRIM_0;                        /**< LDO TRIM Configuration 0, offset: 0x1C */
  __IO uint32_t LDO_TRIM_1;                        /**< LDO TRIM Configuration 1, offset: 0x20 */
  __I  uint32_t LDO_TRIM_RES_0;                    /**< RF Analog LDO Trim Res Control 0, offset: 0x24 */
  __I  uint32_t LDO_TRIM_RES_1;                    /**< RF Analog LDO Trim Res Control 1, offset: 0x28 */
  __IO uint32_t LCL_CFG0;                          /**< LCL CTRL CFG 0, offset: 0x2C */
  __IO uint32_t LCL_CFG1;                          /**< LCL CTRL CFG 1, offset: 0x30 */
  __IO uint32_t LCL_TX_CFG0;                       /**< LCL CTRL TX CONFIG0, offset: 0x34 */
  __IO uint32_t LCL_TX_CFG1;                       /**< LCL CTRL TX CONFIG1, offset: 0x38 */
  __IO uint32_t RSM_CTRL6;                         /**< RSM CTRL 6, offset: 0x3C */
  __IO uint32_t LCL_RX_CFG0;                       /**< LCL CTRL RX CONFIG0, offset: 0x40 */
  __IO uint32_t LCL_RX_CFG1;                       /**< LCL CTRL RX CONFIG1, offset: 0x44 */
  __I  uint32_t LCL_RX_CFG2;                       /**< LCL CTRL RX CONFIG2, offset: 0x48 */
  __IO uint32_t LCL_PM_MSB;                        /**< LCL CTRL PM MSB, offset: 0x4C */
  __IO uint32_t LCL_PM_LSB;                        /**< LCL CTRL PM LSB, offset: 0x50 */
  __IO uint32_t LCL_GPIO_CTRL0;                    /**< LCL GPIO CTRL 0, offset: 0x54 */
  __IO uint32_t LCL_GPIO_CTRL1;                    /**< LCL GPIO CTRL 1, offset: 0x58 */
  __IO uint32_t LCL_GPIO_CTRL2;                    /**< LCL GPIO CTRL 2, offset: 0x5C */
  __IO uint32_t LCL_GPIO_CTRL3;                    /**< LCL GPIO CTRL 3, offset: 0x60 */
  __IO uint32_t LCL_GPIO_CTRL4;                    /**< LCL GPIO CTRL 4, offset: 0x64 */
  __IO uint32_t LCL_DMA_MASK_DELAY;                /**< LCL_DMA_MASK_DELAY, offset: 0x68 */
  __IO uint32_t LCL_DMA_MASK_PERIOD;               /**< LCL_DMA_MASK_PERIOD, offset: 0x6C */
  __I  uint32_t RSM_CSR;                           /**< Ranging Sequence Manager Control and Status, offset: 0x70 */
  __IO uint32_t RSM_CTRL0;                         /**< Ranging Sequence Manager Control, offset: 0x74 */
  __IO uint32_t RSM_CTRL1;                         /**< Ranging Sequence Manager Control, offset: 0x78 */
  __IO uint32_t RSM_CTRL2;                         /**< Ranging Sequence Manager Control, offset: 0x7C */
  __IO uint32_t RSM_CTRL3;                         /**< Ranging Sequence Manager Control, offset: 0x80 */
  __IO uint32_t RSM_CTRL4;                         /**< Ranging Sequence Manager Control, offset: 0x84 */
  __IO uint32_t RSM_CTRL5;                         /**< Ranging Sequence Manager Control, offset: 0x88 */
  __IO uint32_t RSM_CTRL7;                         /**< Ranging Sequence Manager Control, offset: 0x8C */
  __IO uint32_t RSM_INT_STATUS;                    /**< Ranging Sequence Manager interrupt status, offset: 0x90 */
  __IO uint32_t RSM_INT_ENABLE;                    /**< Ranging Sequence Manager interrupt enable, offset: 0x94 */
  __IO uint32_t DMA_MASK_CTRL;                     /**< DMA_MASK management, offset: 0x98 */
  __IO uint32_t RF_DFT_CTRL;                       /**< RF DFT CTRL, offset: 0x9C */
  __IO uint32_t IPS_FO_ADDR[XCVR_MISC_IPS_FO_ADDRX_COUNT]; /**< IPS FAST OVERWRITE ADDRESS, array offset: 0xA0, array step: 0x4 */
  __IO uint32_t IPS_FO_DRS0_DATA[XCVR_MISC_IPS_FO_DRS0_DATAX_COUNT]; /**< IPS FAST OVERWRITE DRS0 DATA, array offset: 0xC0, array step: 0x4 */
  __IO uint32_t IPS_FO_DRS1_DATA[XCVR_MISC_IPS_FO_DRS1_DATAX_COUNT]; /**< IPS FAST OVERWRITE DRS1 DATA, array offset: 0xE0, array step: 0x4 */
  __IO uint32_t RSM_CONFIG_BUFF;                   /**< Ranging Sequence Manager Configuration Buffer, offset: 0x100 */
  __IO uint32_t RSM_CONFIG_PTR;                    /**< Ranging Sequence Manager Config Pointer, offset: 0x104 */
  __IO uint32_t RSM_RESULT_BUFF;                   /**< Ranging Sequence Manager Result Buffer, offset: 0x108 */
  __IO uint32_t RSM_RESULT_PTR;                    /**< Ranging Sequence Manager Config Pointer, offset: 0x10C */
  __I  uint32_t RSM_PTR;                           /**< Ranging Sequence Manager Pointer, offset: 0x110 */
       uint8_t RESERVED_0[12];
  __IO uint32_t RADIO2HOST;                        /**< Radio to Host Buffer, offset: 0x120 */
  __I  uint32_t HOST2RADIO;                        /**< Host to Radio Buffer, offset: 0x124 */
  __IO uint32_t COEX_CHANNEL0;                     /**< skip coex rf_denied for channel 0 to 31, offset: 0x128 */
  __IO uint32_t COEX_CHANNEL1;                     /**< skip coex rf_denied for channel 32 to 63, offset: 0x12C */
  __IO uint32_t COEX_CHANNEL2;                     /**< skip coex rf_denied for channel 64 to 95, offset: 0x130 */
  __IO uint32_t COEX_CHANNEL3;                     /**< skip coex rf_denied for channel 96 to 127, offset: 0x134 */
  __IO uint32_t COEX_MODE;                         /**< Coexistence mode, offset: 0x138 */
  __I  uint32_t COEX_STATUS;                       /**< Coexistence status, offset: 0x13C */
  __IO uint32_t MISC_INT_STATUS;                   /**< Interrupt status for all coex and dma sources, offset: 0x140 */
  __IO uint32_t MISC_INT_ENABLE;                   /**< Interrupt enable for all coex and dma sources, offset: 0x144 */
} XCVR_MISC_Type;

/* ----------------------------------------------------------------------------
   -- XCVR_MISC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XCVR_MISC_Register_Masks XCVR_MISC Register Masks
 * @{
 */

