zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_MISC.h
#define XCVR_MISC_LCL_CFG0_COMP_EN_MASK          (0x10U)
#define XCVR_MISC_LCL_CFG0_COMP_EN_SHIFT         (4U)
/*! COMP_EN - Pattern Matching Enable */
#define XCVR_MISC_LCL_CFG0_COMP_EN(x)            (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_COMP_EN_SHIFT)) & XCVR_MISC_LCL_CFG0_COMP_EN_MASK)

#define XCVR_MISC_LCL_CFG0_COMP_TX_EN_MASK       (0x20U)
#define XCVR_MISC_LCL_CFG0_COMP_TX_EN_SHIFT      (5U)
/*! COMP_TX_EN - Pattern Matching Enable in TX */
#define XCVR_MISC_LCL_CFG0_COMP_TX_EN(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_COMP_TX_EN_SHIFT)) & XCVR_MISC_LCL_CFG0_COMP_TX_EN_MASK)

#define XCVR_MISC_LCL_CFG0_SW_TRIG_MASK          (0x40U)
#define XCVR_MISC_LCL_CFG0_SW_TRIG_SHIFT         (6U)
/*! SW_TRIG - Software Trigger. Can be used with either RX or TX */
#define XCVR_MISC_LCL_CFG0_SW_TRIG(x)            (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_SW_TRIG_SHIFT)) & XCVR_MISC_LCL_CFG0_SW_TRIG_MASK)

#define XCVR_MISC_LCL_CFG0_LANT_SW_WIGGLE_MASK   (0x80U)
#define XCVR_MISC_LCL_CFG0_LANT_SW_WIGGLE_SHIFT  (7U)
/*! LANT_SW_WIGGLE - LANT_SW Wiggle */
#define XCVR_MISC_LCL_CFG0_LANT_SW_WIGGLE(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_LANT_SW_WIGGLE_SHIFT)) & XCVR_MISC_LCL_CFG0_LANT_SW_WIGGLE_MASK)

#define XCVR_MISC_LCL_CFG0_PM_NUM_BYTES_MASK     (0x300U)
#define XCVR_MISC_LCL_CFG0_PM_NUM_BYTES_SHIFT    (8U)
/*! PM_NUM_BYTES - Number of Bytes to Match
 *  0b00..4 bytes
 *  0b01..5 bytes
 *  0b10..6 bytes
 *  0b11..8 bytes
 */
#define XCVR_MISC_LCL_CFG0_PM_NUM_BYTES(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_PM_NUM_BYTES_SHIFT)) & XCVR_MISC_LCL_CFG0_PM_NUM_BYTES_MASK)

#define XCVR_MISC_LCL_CFG0_LANT_BLOCK_TX_MASK    (0x400U)
#define XCVR_MISC_LCL_CFG0_LANT_BLOCK_TX_SHIFT   (10U)
/*! LANT_BLOCK_TX - Block LANT_SW for TX */
#define XCVR_MISC_LCL_CFG0_LANT_BLOCK_TX(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_LANT_BLOCK_TX_SHIFT)) & XCVR_MISC_LCL_CFG0_LANT_BLOCK_TX_MASK)

#define XCVR_MISC_LCL_CFG0_LANT_BLOCK_RX_MASK    (0x800U)
#define XCVR_MISC_LCL_CFG0_LANT_BLOCK_RX_SHIFT   (11U)
/*! LANT_BLOCK_RX - Block LANT_SW for RX */
#define XCVR_MISC_LCL_CFG0_LANT_BLOCK_RX(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_LANT_BLOCK_RX_SHIFT)) & XCVR_MISC_LCL_CFG0_LANT_BLOCK_RX_MASK)

#define XCVR_MISC_LCL_CFG0_CTE_DUR_MASK          (0x1FF000U)
#define XCVR_MISC_LCL_CFG0_CTE_DUR_SHIFT         (12U)
/*! CTE_DUR - Total Switching Duration */
#define XCVR_MISC_LCL_CFG0_CTE_DUR(x)            (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_CTE_DUR_SHIFT)) & XCVR_MISC_LCL_CFG0_CTE_DUR_MASK)

#define XCVR_MISC_LCL_CFG0_AP_MAX_MASK           (0x1E00000U)
#define XCVR_MISC_LCL_CFG0_AP_MAX_SHIFT          (21U)
/*! AP_MAX - Max number of Antenna paths */
#define XCVR_MISC_LCL_CFG0_AP_MAX(x)             (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_AP_MAX_SHIFT)) & XCVR_MISC_LCL_CFG0_AP_MAX_MASK)

#define XCVR_MISC_LCL_CFG0_ANT_SYNC_MASK         (0x6000000U)
#define XCVR_MISC_LCL_CFG0_ANT_SYNC_SHIFT        (25U)
/*! ANT_SYNC - Reserved */
#define XCVR_MISC_LCL_CFG0_ANT_SYNC(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_ANT_SYNC_SHIFT)) & XCVR_MISC_LCL_CFG0_ANT_SYNC_MASK)

#define XCVR_MISC_LCL_CFG0_DELAY_SIGNED_MASK     (0x8000000U)
#define XCVR_MISC_LCL_CFG0_DELAY_SIGNED_SHIFT    (27U)
/*! DELAY_SIGNED - Delay signed feature */
#define XCVR_MISC_LCL_CFG0_DELAY_SIGNED(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_DELAY_SIGNED_SHIFT)) & XCVR_MISC_LCL_CFG0_DELAY_SIGNED_MASK)

#define XCVR_MISC_LCL_CFG0_LCL_ANT_PERMUT_EN_MASK (0x10000000U)
#define XCVR_MISC_LCL_CFG0_LCL_ANT_PERMUT_EN_SHIFT (28U)
/*! LCL_ANT_PERMUT_EN - Enable antenna permutation for mode 2 and 3 */
#define XCVR_MISC_LCL_CFG0_LCL_ANT_PERMUT_EN(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_LCL_ANT_PERMUT_EN_SHIFT)) & XCVR_MISC_LCL_CFG0_LCL_ANT_PERMUT_EN_MASK)

#define XCVR_MISC_LCL_CFG0_LCL_ADJ_ENDMASK_MASK  (0x20000000U)
#define XCVR_MISC_LCL_CFG0_LCL_ADJ_ENDMASK_SHIFT (29U)
#define XCVR_MISC_LCL_CFG0_LCL_ADJ_ENDMASK(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_LCL_ADJ_ENDMASK_SHIFT)) & XCVR_MISC_LCL_CFG0_LCL_ADJ_ENDMASK_MASK)

#define XCVR_MISC_LCL_CFG0_LCL_GPIO_SEL_MASK     (0x40000000U)
#define XCVR_MISC_LCL_CFG0_LCL_GPIO_SEL_SHIFT    (30U)
/*! LCL_GPIO_SEL - Localization GPIO Select */
#define XCVR_MISC_LCL_CFG0_LCL_GPIO_SEL(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_LCL_GPIO_SEL_SHIFT)) & XCVR_MISC_LCL_CFG0_LCL_GPIO_SEL_MASK)

#define XCVR_MISC_LCL_CFG0_LCL_MODE_MASK         (0x80000000U)
#define XCVR_MISC_LCL_CFG0_LCL_MODE_SHIFT        (31U)
/*! LCL_MODE - Localization Mode
 *  0b0..GenLL configuration.
 *  0b1..Bluetooth LE LL configuration.
 */
#define XCVR_MISC_LCL_CFG0_LCL_MODE(x)           (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG0_LCL_MODE_SHIFT)) & XCVR_MISC_LCL_CFG0_LCL_MODE_MASK)
/*! @} */

/*! @name LCL_CFG1 - LCL CTRL CFG 1 */
/*! @{ */

#define XCVR_MISC_LCL_CFG1_M_ON_DELAY_MASK       (0x3FFU)
#define XCVR_MISC_LCL_CFG1_M_ON_DELAY_SHIFT      (0U)
/*! M_ON_DELAY - M on Delay */
#define XCVR_MISC_LCL_CFG1_M_ON_DELAY(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG1_M_ON_DELAY_SHIFT)) & XCVR_MISC_LCL_CFG1_M_ON_DELAY_MASK)

#define XCVR_MISC_LCL_CFG1_N_ON_DELAY_MASK       (0xF000U)
#define XCVR_MISC_LCL_CFG1_N_ON_DELAY_SHIFT      (12U)
/*! N_ON_DELAY - N on Delay */
#define XCVR_MISC_LCL_CFG1_N_ON_DELAY(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG1_N_ON_DELAY_SHIFT)) & XCVR_MISC_LCL_CFG1_N_ON_DELAY_MASK)

#define XCVR_MISC_LCL_CFG1_ANT_MULTI_PERMUT_MODE_MASK (0x10000U)
#define XCVR_MISC_LCL_CFG1_ANT_MULTI_PERMUT_MODE_SHIFT (16U)
/*! ANT_MULTI_PERMUT_MODE - Multi Antenna permutation mode */
#define XCVR_MISC_LCL_CFG1_ANT_MULTI_PERMUT_MODE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG1_ANT_MULTI_PERMUT_MODE_SHIFT)) & XCVR_MISC_LCL_CFG1_ANT_MULTI_PERMUT_MODE_MASK)

#define XCVR_MISC_LCL_CFG1_ANT_SW_MODE3_MASK     (0x10000000U)
#define XCVR_MISC_LCL_CFG1_ANT_SW_MODE3_SHIFT    (28U)
/*! ANT_SW_MODE3 - Antenna switch for mode 3 PM to DT transition */
#define XCVR_MISC_LCL_CFG1_ANT_SW_MODE3(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG1_ANT_SW_MODE3_SHIFT)) & XCVR_MISC_LCL_CFG1_ANT_SW_MODE3_MASK)

