zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_MISC.h
#define XCVR_MISC_LCL_CFG1_ANT_SW_RF_MASK        (0x20000000U)
#define XCVR_MISC_LCL_CFG1_ANT_SW_RF_SHIFT       (29U)
/*! ANT_SW_RF - Antenna switch trigger mode */
#define XCVR_MISC_LCL_CFG1_ANT_SW_RF(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG1_ANT_SW_RF_SHIFT)) & XCVR_MISC_LCL_CFG1_ANT_SW_RF_MASK)

#define XCVR_MISC_LCL_CFG1_LANT_SW_IE_MASK       (0x40000000U)
#define XCVR_MISC_LCL_CFG1_LANT_SW_IE_SHIFT      (30U)
/*! LANT_SW_IE - Localization Antenna Switch Interrupt Enable
 *  0b0..Localization Antenna Switch interrupt disabled
 *  0b1..Localization Antenna Switch interrupt enabled
 */
#define XCVR_MISC_LCL_CFG1_LANT_SW_IE(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG1_LANT_SW_IE_SHIFT)) & XCVR_MISC_LCL_CFG1_LANT_SW_IE_MASK)

#define XCVR_MISC_LCL_CFG1_LANT_SW_FLAG_MASK     (0x80000000U)
#define XCVR_MISC_LCL_CFG1_LANT_SW_FLAG_SHIFT    (31U)
/*! LANT_SW_FLAG - Localization Antenna Switch Flag */
#define XCVR_MISC_LCL_CFG1_LANT_SW_FLAG(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_CFG1_LANT_SW_FLAG_SHIFT)) & XCVR_MISC_LCL_CFG1_LANT_SW_FLAG_MASK)
/*! @} */

/*! @name LCL_TX_CFG0 - LCL CTRL TX CONFIG0 */
/*! @{ */

#define XCVR_MISC_LCL_TX_CFG0_TX_DELAY_MASK      (0x7FFU)
#define XCVR_MISC_LCL_TX_CFG0_TX_DELAY_SHIFT     (0U)
/*! TX_DELAY - Interval delay before TX switching begins. */
#define XCVR_MISC_LCL_TX_CFG0_TX_DELAY(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG0_TX_DELAY_SHIFT)) & XCVR_MISC_LCL_TX_CFG0_TX_DELAY_MASK)

#define XCVR_MISC_LCL_TX_CFG0_TX_DELAY_OFF_MASK  (0xFF0000U)
#define XCVR_MISC_LCL_TX_CFG0_TX_DELAY_OFF_SHIFT (16U)
/*! TX_DELAY_OFF - Fine sample delay after TX_DELAY. */
#define XCVR_MISC_LCL_TX_CFG0_TX_DELAY_OFF(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG0_TX_DELAY_OFF_SHIFT)) & XCVR_MISC_LCL_TX_CFG0_TX_DELAY_OFF_MASK)

#define XCVR_MISC_LCL_TX_CFG0_TX_SW_FRAC_OFFSET_DN_MASK (0x7000000U)
#define XCVR_MISC_LCL_TX_CFG0_TX_SW_FRAC_OFFSET_DN_SHIFT (24U)
/*! TX_SW_FRAC_OFFSET_DN - TX_SW_FRAC_OFFSET_DN */
#define XCVR_MISC_LCL_TX_CFG0_TX_SW_FRAC_OFFSET_DN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG0_TX_SW_FRAC_OFFSET_DN_SHIFT)) & XCVR_MISC_LCL_TX_CFG0_TX_SW_FRAC_OFFSET_DN_MASK)

#define XCVR_MISC_LCL_TX_CFG0_TX_SW_FRAC_OFFSET_UP_MASK (0x70000000U)
#define XCVR_MISC_LCL_TX_CFG0_TX_SW_FRAC_OFFSET_UP_SHIFT (28U)
/*! TX_SW_FRAC_OFFSET_UP - TX_SW_FRAC_OFFSET_UP */
#define XCVR_MISC_LCL_TX_CFG0_TX_SW_FRAC_OFFSET_UP(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG0_TX_SW_FRAC_OFFSET_UP_SHIFT)) & XCVR_MISC_LCL_TX_CFG0_TX_SW_FRAC_OFFSET_UP_MASK)
/*! @} */

/*! @name LCL_TX_CFG1 - LCL CTRL TX CONFIG1 */
/*! @{ */

#define XCVR_MISC_LCL_TX_CFG1_TX_SPINT_MASK      (0x7FU)
#define XCVR_MISC_LCL_TX_CFG1_TX_SPINT_SHIFT     (0U)
/*! TX_SPINT - Number of TX Samples that define the length of an Interval, where 0=1sample, 1=2sample, etc. */
#define XCVR_MISC_LCL_TX_CFG1_TX_SPINT(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG1_TX_SPINT_SHIFT)) & XCVR_MISC_LCL_TX_CFG1_TX_SPINT_MASK)

#define XCVR_MISC_LCL_TX_CFG1_TX_LO_PER_MASK     (0x3F80U)
#define XCVR_MISC_LCL_TX_CFG1_TX_LO_PER_SHIFT    (7U)
/*! TX_LO_PER - Primary Number of intervals for antenna LOW */
#define XCVR_MISC_LCL_TX_CFG1_TX_LO_PER(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG1_TX_LO_PER_SHIFT)) & XCVR_MISC_LCL_TX_CFG1_TX_LO_PER_MASK)

#define XCVR_MISC_LCL_TX_CFG1_TX_HI_PER_MASK     (0x1FC000U)
#define XCVR_MISC_LCL_TX_CFG1_TX_HI_PER_SHIFT    (14U)
/*! TX_HI_PER - Primary Number of intervals for antenna HIGH */
#define XCVR_MISC_LCL_TX_CFG1_TX_HI_PER(x)       (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG1_TX_HI_PER_SHIFT)) & XCVR_MISC_LCL_TX_CFG1_TX_HI_PER_MASK)

#define XCVR_MISC_LCL_TX_CFG1_TX_ANT_TRIG_SEL_MASK (0xE00000U)
#define XCVR_MISC_LCL_TX_CFG1_TX_ANT_TRIG_SEL_SHIFT (21U)
/*! TX_ANT_TRIG_SEL - Selects Trigger for TX
 *  0b000..Software Trigger
 *  0b001..LCL Pattern Found
 *  0b010..CRC Complete
 *  0b011..PA Warm-up complete
 *  0b100..RBME Tx Done
 *  0b101..cte_en from NBU
 *  0b110..Ranging sequence manager lcl_tx_trigger
 */
#define XCVR_MISC_LCL_TX_CFG1_TX_ANT_TRIG_SEL(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG1_TX_ANT_TRIG_SEL_SHIFT)) & XCVR_MISC_LCL_TX_CFG1_TX_ANT_TRIG_SEL_MASK)

#define XCVR_MISC_LCL_TX_CFG1_TX_SW_ACTIVE_MASK  (0x1000000U)
#define XCVR_MISC_LCL_TX_CFG1_TX_SW_ACTIVE_SHIFT (24U)
/*! TX_SW_ACTIVE - TX_SW_ACTIVE */
#define XCVR_MISC_LCL_TX_CFG1_TX_SW_ACTIVE(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG1_TX_SW_ACTIVE_SHIFT)) & XCVR_MISC_LCL_TX_CFG1_TX_SW_ACTIVE_MASK)

#define XCVR_MISC_LCL_TX_CFG1_TX_SW_OFFSET_MASK  (0x1E000000U)
#define XCVR_MISC_LCL_TX_CFG1_TX_SW_OFFSET_SHIFT (25U)
/*! TX_SW_OFFSET - TX_SW_OFFSET */
#define XCVR_MISC_LCL_TX_CFG1_TX_SW_OFFSET(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG1_TX_SW_OFFSET_SHIFT)) & XCVR_MISC_LCL_TX_CFG1_TX_SW_OFFSET_MASK)

#define XCVR_MISC_LCL_TX_CFG1_TX_SW_ADD_OFFSET_UP_MASK (0xE0000000U)
#define XCVR_MISC_LCL_TX_CFG1_TX_SW_ADD_OFFSET_UP_SHIFT (29U)
/*! TX_SW_ADD_OFFSET_UP - TX_SW_ADD_OFFSET_UP */
#define XCVR_MISC_LCL_TX_CFG1_TX_SW_ADD_OFFSET_UP(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_LCL_TX_CFG1_TX_SW_ADD_OFFSET_UP_SHIFT)) & XCVR_MISC_LCL_TX_CFG1_TX_SW_ADD_OFFSET_UP_MASK)
/*! @} */

/*! @name RSM_CTRL6 - RSM CTRL 6 */
/*! @{ */

#define XCVR_MISC_RSM_CTRL6_RSM_RXLAT_DIG_MASK   (0xFU)
#define XCVR_MISC_RSM_CTRL6_RSM_RXLAT_DIG_SHIFT  (0U)
/*! RSM_RXLAT_DIG - Digital Latency */
#define XCVR_MISC_RSM_CTRL6_RSM_RXLAT_DIG(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL6_RSM_RXLAT_DIG_SHIFT)) & XCVR_MISC_RSM_CTRL6_RSM_RXLAT_DIG_MASK)

#define XCVR_MISC_RSM_CTRL6_RSM_SKIP_RECYCLE_R2R_MASK (0x10U)
#define XCVR_MISC_RSM_CTRL6_RSM_SKIP_RECYCLE_R2R_SHIFT (4U)
/*! RSM_SKIP_RECYCLE_R2R - RECYCLE R2R */
#define XCVR_MISC_RSM_CTRL6_RSM_SKIP_RECYCLE_R2R(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL6_RSM_SKIP_RECYCLE_R2R_SHIFT)) & XCVR_MISC_RSM_CTRL6_RSM_SKIP_RECYCLE_R2R_MASK)

#define XCVR_MISC_RSM_CTRL6_RSM_PKTRAM_EXTEND_MASK (0x20U)
#define XCVR_MISC_RSM_CTRL6_RSM_PKTRAM_EXTEND_SHIFT (5U)
/*! RSM_PKTRAM_EXTEND - Packet Ram Extend Information */
#define XCVR_MISC_RSM_CTRL6_RSM_PKTRAM_EXTEND(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL6_RSM_PKTRAM_EXTEND_SHIFT)) & XCVR_MISC_RSM_CTRL6_RSM_PKTRAM_EXTEND_MASK)

