zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_MISC.h
/*! @name RSM_CTRL7 - Ranging Sequence Manager Control */
/*! @{ */

#define XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_MASK   (0x3FFFFU)
#define XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_SHIFT  (0U)
/*! RSM_TIME_CORR - Timing drift correction counter value */
#define XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_SHIFT)) & XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_MASK)

#define XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_DELTA_MASK (0xC0000U)
#define XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_DELTA_SHIFT (18U)
/*! RSM_TIME_CORR_DELTA - Timing drift delta value
 *  0b00..0 us
 *  0b01..+1 us
 *  0b11..-1 us
 */
#define XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_DELTA(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_DELTA_SHIFT)) & XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_DELTA_MASK)

#define XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_MODE_MASK (0x300000U)
#define XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_MODE_SHIFT (20U)
/*! RSM_TIME_CORR_MODE - Timing drift correction */
#define XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_MODE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_MODE_SHIFT)) & XCVR_MISC_RSM_CTRL7_RSM_TIME_CORR_MODE_MASK)

#define XCVR_MISC_RSM_CTRL7_RSM_TIME_ALIGN_MODE_MASK (0x400000U)
#define XCVR_MISC_RSM_CTRL7_RSM_TIME_ALIGN_MODE_SHIFT (22U)
/*! RSM_TIME_ALIGN_MODE - Timing alignment correction */
#define XCVR_MISC_RSM_CTRL7_RSM_TIME_ALIGN_MODE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL7_RSM_TIME_ALIGN_MODE_SHIFT)) & XCVR_MISC_RSM_CTRL7_RSM_TIME_ALIGN_MODE_MASK)

#define XCVR_MISC_RSM_CTRL7_RSM_TIME_ALIGN_OFFSET_MASK (0x1800000U)
#define XCVR_MISC_RSM_CTRL7_RSM_TIME_ALIGN_OFFSET_SHIFT (23U)
/*! RSM_TIME_ALIGN_OFFSET - Timing alignment correction offset */
#define XCVR_MISC_RSM_CTRL7_RSM_TIME_ALIGN_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CTRL7_RSM_TIME_ALIGN_OFFSET_SHIFT)) & XCVR_MISC_RSM_CTRL7_RSM_TIME_ALIGN_OFFSET_MASK)
/*! @} */

/*! @name RSM_INT_STATUS - Ranging Sequence Manager interrupt status */
/*! @{ */

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_EOS_MASK (0x1U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_EOS_SHIFT (0U)
/*! RSM_IRQ_EOS - RSM_IRQ_EOS Flag */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_EOS(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_EOS_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_EOS_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_ABORT_MASK (0x2U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_ABORT_SHIFT (1U)
/*! RSM_IRQ_ABORT - RSM_IRQ_ABORT Flag */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_ABORT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_ABORT_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_ABORT_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_IP1_MASK (0x4U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_IP1_SHIFT (2U)
/*! RSM_IRQ_IP1 - RSM_IRQ_IP1 Flag */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_IP1(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_IP1_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_IP1_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_IP2_MASK (0x8U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_IP2_SHIFT (3U)
/*! RSM_IRQ_IP2 - RSM_IRQ_IP2 Flag */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_IP2(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_IP2_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_IP2_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FC_MASK (0x10U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FC_SHIFT (4U)
/*! RSM_IRQ_FC - RSM_IRQ_FC Flag */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FC(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FC_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FC_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FM_RX_MASK (0x20U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FM_RX_SHIFT (5U)
/*! RSM_IRQ_FM_RX - RSM_IRQ_FM_RX Flag */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FM_RX(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FM_RX_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FM_RX_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FM_TX_MASK (0x40U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FM_TX_SHIFT (6U)
/*! RSM_IRQ_FM_TX - RSM_IRQ_FM_TX Flag */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FM_TX(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FM_TX_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_FM_TX_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_PM_RX_MASK (0x80U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_PM_RX_SHIFT (7U)
/*! RSM_IRQ_PM_RX - RSM_IRQ_PM_RX Flag */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_PM_RX(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_PM_RX_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_PM_RX_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_PM_TX_MASK (0x100U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_PM_TX_SHIFT (8U)
/*! RSM_IRQ_PM_TX - RSM_IRQ_PM_TX Flag */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_PM_TX(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_PM_TX_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_PM_TX_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_DT_RX_MASK (0x200U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_DT_RX_SHIFT (9U)
/*! RSM_IRQ_DT_RX - RSM_IRQ_DT_RX Flag */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_DT_RX(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_DT_RX_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_DT_RX_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_DT_TX_MASK (0x400U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_DT_TX_SHIFT (10U)
/*! RSM_IRQ_DT_TX - RSM_IRQ_DT_TX Flag */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_DT_TX(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_DT_TX_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_DT_TX_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_STEP_MASK (0x800U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_STEP_SHIFT (11U)
/*! RSM_IRQ_STEP - RSM_IRQ_STEP */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_STEP(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_STEP_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_STEP_MASK)

#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_REF_RTT_DONE_MASK (0x1000U)
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_REF_RTT_DONE_SHIFT (12U)
/*! RSM_IRQ_REF_RTT_DONE - RSM_IRQ_REF_RTT_DONE */
#define XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_REF_RTT_DONE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_REF_RTT_DONE_SHIFT)) & XCVR_MISC_RSM_INT_STATUS_RSM_IRQ_REF_RTT_DONE_MASK)
/*! @} */

/*! @name RSM_INT_ENABLE - Ranging Sequence Manager interrupt enable */
/*! @{ */

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_EOS_EN_MASK (0x1U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_EOS_EN_SHIFT (0U)
/*! RSM_IRQ_EOS_EN - RSM_IRQ_EOS_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_EOS_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_EOS_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_EOS_EN_MASK)

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_ABORT_EN_MASK (0x2U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_ABORT_EN_SHIFT (1U)
/*! RSM_IRQ_ABORT_EN - RSM_IRQ_ABORT_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_ABORT_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_ABORT_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_ABORT_EN_MASK)

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_IP1_EN_MASK (0x4U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_IP1_EN_SHIFT (2U)
/*! RSM_IRQ_IP1_EN - RSM_IRQ_IP1_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_IP1_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_IP1_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_IP1_EN_MASK)

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_IP2_EN_MASK (0x8U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_IP2_EN_SHIFT (3U)
/*! RSM_IRQ_IP2_EN - RSM_IRQ_IP2_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_IP2_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_IP2_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_IP2_EN_MASK)

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FC_EN_MASK (0x10U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FC_EN_SHIFT (4U)
/*! RSM_IRQ_FC_EN - RSM_IRQ_FC_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FC_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FC_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FC_EN_MASK)

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FM_RX_EN_MASK (0x20U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FM_RX_EN_SHIFT (5U)
/*! RSM_IRQ_FM_RX_EN - RSM_IRQ_FM_RX_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FM_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FM_RX_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FM_RX_EN_MASK)

