zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_MISC.h
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FM_TX_EN_MASK (0x40U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FM_TX_EN_SHIFT (6U)
/*! RSM_IRQ_FM_TX_EN - RSM_IRQ_FM_TX_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FM_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FM_TX_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_FM_TX_EN_MASK)

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_PM_RX_EN_MASK (0x80U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_PM_RX_EN_SHIFT (7U)
/*! RSM_IRQ_PM_RX_EN - RSM_IRQ_PM_RX_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_PM_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_PM_RX_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_PM_RX_EN_MASK)

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_PM_TX_EN_MASK (0x100U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_PM_TX_EN_SHIFT (8U)
/*! RSM_IRQ_PM_TX_EN - RSM_IRQ_PM_TX_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_PM_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_PM_TX_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_PM_TX_EN_MASK)

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_DT_RX_EN_MASK (0x200U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_DT_RX_EN_SHIFT (9U)
/*! RSM_IRQ_DT_RX_EN - RSM_IRQ_DT_RX_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_DT_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_DT_RX_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_DT_RX_EN_MASK)

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_DT_TX_EN_MASK (0x400U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_DT_TX_EN_SHIFT (10U)
/*! RSM_IRQ_DT_TX_EN - RSM_IRQ_DT_TX_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_DT_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_DT_TX_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_DT_TX_EN_MASK)

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_STEP_EN_MASK (0x800U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_STEP_EN_SHIFT (11U)
/*! RSM_IRQ_STEP_EN - RSM_IRQ_STEP_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_STEP_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_STEP_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_STEP_EN_MASK)

#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_REF_RTT_DONE_EN_MASK (0x1000U)
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_REF_RTT_DONE_EN_SHIFT (12U)
/*! RSM_IRQ_REF_RTT_DONE_EN - RSM_IRQ_REF_RTT_DONE_EN */
#define XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_REF_RTT_DONE_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_REF_RTT_DONE_EN_SHIFT)) & XCVR_MISC_RSM_INT_ENABLE_RSM_IRQ_REF_RTT_DONE_EN_MASK)
/*! @} */

/*! @name DMA_MASK_CTRL - DMA_MASK management */
/*! @{ */

#define XCVR_MISC_DMA_MASK_CTRL_DMA_MASK_CENTER_MASK (0xFU)
#define XCVR_MISC_DMA_MASK_CTRL_DMA_MASK_CENTER_SHIFT (0U)
/*! DMA_MASK_CENTER - DMA_MASK centering
 *  0b0000..No centering
 *  0b0001..1 us centered window
 *  0b0010..2 us centered window
 *  0b0011..4 us centered window
 *  0b0100..8 us centered window
 *  0b0101..16 us centered window
 *  0b0110..32 us centered window
 *  0b0111..64 us centered window
 *  0b1000..128 us centered window
 *  0b1001..256 us centered window
 *  0b1010..512 us centered window
 *  0b1011..1024 us centered window
 */
#define XCVR_MISC_DMA_MASK_CTRL_DMA_MASK_CENTER(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_DMA_MASK_CTRL_DMA_MASK_CENTER_SHIFT)) & XCVR_MISC_DMA_MASK_CTRL_DMA_MASK_CENTER_MASK)

#define XCVR_MISC_DMA_MASK_CTRL_DMA_SIGNAL_VALID_MASK_SEL_MASK (0xF0U)
#define XCVR_MISC_DMA_MASK_CTRL_DMA_SIGNAL_VALID_MASK_SEL_SHIFT (4U)
/*! DMA_SIGNAL_VALID_MASK_SEL - MASK selection for DMA engine during RX data capture */
#define XCVR_MISC_DMA_MASK_CTRL_DMA_SIGNAL_VALID_MASK_SEL(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_DMA_MASK_CTRL_DMA_SIGNAL_VALID_MASK_SEL_SHIFT)) & XCVR_MISC_DMA_MASK_CTRL_DMA_SIGNAL_VALID_MASK_SEL_MASK)

#define XCVR_MISC_DMA_MASK_CTRL_DBG_SIGNAL_VALID_MASK_SEL_MASK (0xF00U)
#define XCVR_MISC_DMA_MASK_CTRL_DBG_SIGNAL_VALID_MASK_SEL_SHIFT (8U)
/*! DBG_SIGNAL_VALID_MASK_SEL - MASK selection for DBG engine during RX data capture */
#define XCVR_MISC_DMA_MASK_CTRL_DBG_SIGNAL_VALID_MASK_SEL(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_DMA_MASK_CTRL_DBG_SIGNAL_VALID_MASK_SEL_SHIFT)) & XCVR_MISC_DMA_MASK_CTRL_DBG_SIGNAL_VALID_MASK_SEL_MASK)

#define XCVR_MISC_DMA_MASK_CTRL_DMA_DTRX_PAYLOAD_EN_MASK (0x3000U)
#define XCVR_MISC_DMA_MASK_CTRL_DMA_DTRX_PAYLOAD_EN_SHIFT (12U)
/*! DMA_DTRX_PAYLOAD_EN - Select Payload transfer mode for DMA engine during RX data capture
 *  0b00..No payload transfer, only DMA page transfer
 *  0b01..Only payload transfer
 *  0b10..DMA page + payload transfer is delayed from 2 clock cycles
 *  0b11..DMA page + payload transfer but payload transfer overrides DMA page transfer
 */
#define XCVR_MISC_DMA_MASK_CTRL_DMA_DTRX_PAYLOAD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_DMA_MASK_CTRL_DMA_DTRX_PAYLOAD_EN_SHIFT)) & XCVR_MISC_DMA_MASK_CTRL_DMA_DTRX_PAYLOAD_EN_MASK)

#define XCVR_MISC_DMA_MASK_CTRL_DBG_DTRX_PAYLOAD_EN_MASK (0xC000U)
#define XCVR_MISC_DMA_MASK_CTRL_DBG_DTRX_PAYLOAD_EN_SHIFT (14U)
/*! DBG_DTRX_PAYLOAD_EN - Select Payload transfer mode for DMA engine during RX data capture
 *  0b00..No payload transfer, only DMA page transfer
 *  0b01..Only payload transfer
 *  0b10..DMA page + payload transfer is delayed from 2 clock cycles
 *  0b11..DMA page + payload transfer but payload transfer overrides DMA page transfer
 */
#define XCVR_MISC_DMA_MASK_CTRL_DBG_DTRX_PAYLOAD_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_DMA_MASK_CTRL_DBG_DTRX_PAYLOAD_EN_SHIFT)) & XCVR_MISC_DMA_MASK_CTRL_DBG_DTRX_PAYLOAD_EN_MASK)
/*! @} */

/*! @name RF_DFT_CTRL - RF DFT CTRL */
/*! @{ */

#define XCVR_MISC_RF_DFT_CTRL_RADIO_DFT_MODE_MASK (0xFU)
#define XCVR_MISC_RF_DFT_CTRL_RADIO_DFT_MODE_SHIFT (0U)
/*! RADIO_DFT_MODE - Radio DFT mode control
 *  0b0000..Normal Mode
 *  0b0001..Carrier Only
 *  0b0010..Pattern Register
 *  0b0011..LFSR
 *  0b0100..RAM Modulation
 *  0b1010..Coarse Tune BIST, no modulation
 *  0b1011..PLL Locking BIST, no modulation
 *  0b1100..HPM DAC Cal BIST, no modulation
 */
#define XCVR_MISC_RF_DFT_CTRL_RADIO_DFT_MODE(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RF_DFT_CTRL_RADIO_DFT_MODE_SHIFT)) & XCVR_MISC_RF_DFT_CTRL_RADIO_DFT_MODE_MASK)
/*! @} */

/*! @name IPS_FO_ADDR - IPS FAST OVERWRITE ADDRESS */
/*! @{ */

#define XCVR_MISC_IPS_FO_ADDR_ADDR_MASK          (0xFFFU)
#define XCVR_MISC_IPS_FO_ADDR_ADDR_SHIFT         (0U)
/*! ADDR - IPS Address */
#define XCVR_MISC_IPS_FO_ADDR_ADDR(x)            (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_IPS_FO_ADDR_ADDR_SHIFT)) & XCVR_MISC_IPS_FO_ADDR_ADDR_MASK)

#define XCVR_MISC_IPS_FO_ADDR_ENTRY_RX_MASK      (0x1000U)
#define XCVR_MISC_IPS_FO_ADDR_ENTRY_RX_SHIFT     (12U)
/*! ENTRY_RX - Enable Entry for RX */
#define XCVR_MISC_IPS_FO_ADDR_ENTRY_RX(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_IPS_FO_ADDR_ENTRY_RX_SHIFT)) & XCVR_MISC_IPS_FO_ADDR_ENTRY_RX_MASK)

#define XCVR_MISC_IPS_FO_ADDR_ENTRY_TX_MASK      (0x2000U)
#define XCVR_MISC_IPS_FO_ADDR_ENTRY_TX_SHIFT     (13U)
/*! ENTRY_TX - Enable Entry for TX */
#define XCVR_MISC_IPS_FO_ADDR_ENTRY_TX(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_IPS_FO_ADDR_ENTRY_TX_SHIFT)) & XCVR_MISC_IPS_FO_ADDR_ENTRY_TX_MASK)
/*! @} */

