zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_MISC.h
/* The count of XCVR_MISC_IPS_FO_ADDR */
#define XCVR_MISC_IPS_FO_ADDR_COUNT              (8U)

/*! @name IPS_FO_DRS0_DATA - IPS FAST OVERWRITE DRS0 DATA */
/*! @{ */

#define XCVR_MISC_IPS_FO_DRS0_DATA_DRS0_DATA_MASK (0xFFFFFFFFU)
#define XCVR_MISC_IPS_FO_DRS0_DATA_DRS0_DATA_SHIFT (0U)
/*! DRS0_DATA - Fast Overwrite DRS0 data */
#define XCVR_MISC_IPS_FO_DRS0_DATA_DRS0_DATA(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_IPS_FO_DRS0_DATA_DRS0_DATA_SHIFT)) & XCVR_MISC_IPS_FO_DRS0_DATA_DRS0_DATA_MASK)
/*! @} */

/* The count of XCVR_MISC_IPS_FO_DRS0_DATA */
#define XCVR_MISC_IPS_FO_DRS0_DATA_COUNT         (8U)

/*! @name IPS_FO_DRS1_DATA - IPS FAST OVERWRITE DRS1 DATA */
/*! @{ */

#define XCVR_MISC_IPS_FO_DRS1_DATA_DRS1_DATA_MASK (0xFFFFFFFFU)
#define XCVR_MISC_IPS_FO_DRS1_DATA_DRS1_DATA_SHIFT (0U)
/*! DRS1_DATA - Fast Overwrite DRS1 data */
#define XCVR_MISC_IPS_FO_DRS1_DATA_DRS1_DATA(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_IPS_FO_DRS1_DATA_DRS1_DATA_SHIFT)) & XCVR_MISC_IPS_FO_DRS1_DATA_DRS1_DATA_MASK)
/*! @} */

/* The count of XCVR_MISC_IPS_FO_DRS1_DATA */
#define XCVR_MISC_IPS_FO_DRS1_DATA_COUNT         (8U)

/*! @name RSM_CONFIG_BUFF - Ranging Sequence Manager Configuration Buffer */
/*! @{ */

#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_BASE_ADDR_MASK (0xFFCU)
#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_BASE_ADDR_SHIFT (2U)
/*! RSM_CONFIG_BASE_ADDR - RSM CONFIG BUFFER BASE ADDRESS */
#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_BASE_ADDR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_BASE_ADDR_SHIFT)) & XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_BASE_ADDR_MASK)

#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_BUFF_LOC_MASK (0x1000U)
#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_BUFF_LOC_SHIFT (12U)
/*! RSM_CONFIG_BUFF_LOC - RSM CONFIG BUFFER LOCATION
 *  0b0..located in Tx Packet RAM
 *  0b1..located in Rx Packet RAM
 */
#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_BUFF_LOC(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_BUFF_LOC_SHIFT)) & XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_BUFF_LOC_MASK)

#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_DEPTH_MASK (0xFF8000U)
#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_DEPTH_SHIFT (15U)
/*! RSM_CONFIG_DEPTH - RSM CONFIG BUFFER DEPTH */
#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_DEPTH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_DEPTH_SHIFT)) & XCVR_MISC_RSM_CONFIG_BUFF_RSM_CONFIG_DEPTH_MASK)

#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_INT_NBSTEP_MASK (0xFF000000U)
#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_INT_NBSTEP_SHIFT (24U)
/*! RSM_INT_NBSTEP - RSM INTERRUPT STEP NUMBER */
#define XCVR_MISC_RSM_CONFIG_BUFF_RSM_INT_NBSTEP(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CONFIG_BUFF_RSM_INT_NBSTEP_SHIFT)) & XCVR_MISC_RSM_CONFIG_BUFF_RSM_INT_NBSTEP_MASK)
/*! @} */

/*! @name RSM_CONFIG_PTR - Ranging Sequence Manager Config Pointer */
/*! @{ */

#define XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_WR_PTR_MASK (0xFFCU)
#define XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_WR_PTR_SHIFT (2U)
/*! RSM_CONFIG_WR_PTR - RSM CONFIG WRITE POINTER */
#define XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_WR_PTR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_WR_PTR_SHIFT)) & XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_WR_PTR_MASK)

#define XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_WR_PAGE_MASK (0x1000U)
#define XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_WR_PAGE_SHIFT (12U)
/*! RSM_CONFIG_WR_PAGE - RSM CONFIG WRITE PAGE */
#define XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_WR_PAGE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_WR_PAGE_SHIFT)) & XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_WR_PAGE_MASK)

#define XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_START_PTR_MASK (0xFFC0000U)
#define XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_START_PTR_SHIFT (18U)
/*! RSM_CONFIG_START_PTR - RSM CONFIG START POINTER */
#define XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_START_PTR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_START_PTR_SHIFT)) & XCVR_MISC_RSM_CONFIG_PTR_RSM_CONFIG_START_PTR_MASK)
/*! @} */

/*! @name RSM_RESULT_BUFF - Ranging Sequence Manager Result Buffer */
/*! @{ */

#define XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_BASE_ADDR_MASK (0xFFCU)
#define XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_BASE_ADDR_SHIFT (2U)
/*! RSM_RESULT_BASE_ADDR - RSM RESULT BUFFER BASE ADDRESS */
#define XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_BASE_ADDR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_BASE_ADDR_SHIFT)) & XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_BASE_ADDR_MASK)

#define XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_BUFF_LOC_MASK (0x1000U)
#define XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_BUFF_LOC_SHIFT (12U)
/*! RSM_RESULT_BUFF_LOC - RSM RESULT BUFFER LOCATION
 *  0b0..located in TX Packet RAM
 *  0b1..located in RX Packet RAM
 */
#define XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_BUFF_LOC(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_BUFF_LOC_SHIFT)) & XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_BUFF_LOC_MASK)

#define XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_DEPTH_MASK (0xFF8000U)
#define XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_DEPTH_SHIFT (15U)
/*! RSM_RESULT_DEPTH - RSM RESULT BUFFER DEPTH */
#define XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_DEPTH(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_DEPTH_SHIFT)) & XCVR_MISC_RSM_RESULT_BUFF_RSM_RESULT_DEPTH_MASK)
/*! @} */

/*! @name RSM_RESULT_PTR - Ranging Sequence Manager Config Pointer */
/*! @{ */

#define XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_RD_PTR_MASK (0xFFCU)
#define XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_RD_PTR_SHIFT (2U)
/*! RSM_RESULT_RD_PTR - RSM RESULT READ POINTER */
#define XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_RD_PTR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_RD_PTR_SHIFT)) & XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_RD_PTR_MASK)

#define XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_RD_PAGE_MASK (0x1000U)
#define XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_RD_PAGE_SHIFT (12U)
/*! RSM_RESULT_RD_PAGE - RSM RESULT READ PAGE */
#define XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_RD_PAGE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_RD_PAGE_SHIFT)) & XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_RD_PAGE_MASK)

#define XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_START_PTR_MASK (0xFFC0000U)
#define XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_START_PTR_SHIFT (18U)
/*! RSM_RESULT_START_PTR - RSM RESULT START POINTER */
#define XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_START_PTR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_START_PTR_SHIFT)) & XCVR_MISC_RSM_RESULT_PTR_RSM_RESULT_START_PTR_MASK)

