zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_MISC.h
#define XCVR_MISC_RSM_RESULT_PTR_RSM_PCBD_CTUNE_SEL_MASK (0x10000000U)
#define XCVR_MISC_RSM_RESULT_PTR_RSM_PCBD_CTUNE_SEL_SHIFT (28U)
/*! RSM_PCBD_CTUNE_SEL - RSM PCBD CTUNE SELECT */
#define XCVR_MISC_RSM_RESULT_PTR_RSM_PCBD_CTUNE_SEL(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_RESULT_PTR_RSM_PCBD_CTUNE_SEL_SHIFT)) & XCVR_MISC_RSM_RESULT_PTR_RSM_PCBD_CTUNE_SEL_MASK)

#define XCVR_MISC_RSM_RESULT_PTR_RSM_BUFFER_ABORT_EN_MASK (0x80000000U)
#define XCVR_MISC_RSM_RESULT_PTR_RSM_BUFFER_ABORT_EN_SHIFT (31U)
/*! RSM_BUFFER_ABORT_EN - RSM BUFFER ABORT ENABLE */
#define XCVR_MISC_RSM_RESULT_PTR_RSM_BUFFER_ABORT_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_RESULT_PTR_RSM_BUFFER_ABORT_EN_SHIFT)) & XCVR_MISC_RSM_RESULT_PTR_RSM_BUFFER_ABORT_EN_MASK)
/*! @} */

/*! @name RSM_PTR - Ranging Sequence Manager Pointer */
/*! @{ */

#define XCVR_MISC_RSM_PTR_RSM_RD_PTR_MASK        (0xFFCU)
#define XCVR_MISC_RSM_PTR_RSM_RD_PTR_SHIFT       (2U)
/*! RSM_RD_PTR - RSM CONFIG READ POINTER */
#define XCVR_MISC_RSM_PTR_RSM_RD_PTR(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_PTR_RSM_RD_PTR_SHIFT)) & XCVR_MISC_RSM_PTR_RSM_RD_PTR_MASK)

#define XCVR_MISC_RSM_PTR_RSM_RD_PAGE_MASK       (0x1000U)
#define XCVR_MISC_RSM_PTR_RSM_RD_PAGE_SHIFT      (12U)
/*! RSM_RD_PAGE - RSM CONFIG READ PAGE */
#define XCVR_MISC_RSM_PTR_RSM_RD_PAGE(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_PTR_RSM_RD_PAGE_SHIFT)) & XCVR_MISC_RSM_PTR_RSM_RD_PAGE_MASK)

#define XCVR_MISC_RSM_PTR_RSM_WR_PTR_MASK        (0xFFC0000U)
#define XCVR_MISC_RSM_PTR_RSM_WR_PTR_SHIFT       (18U)
/*! RSM_WR_PTR - RSM RESULT WRITE POINTER */
#define XCVR_MISC_RSM_PTR_RSM_WR_PTR(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_PTR_RSM_WR_PTR_SHIFT)) & XCVR_MISC_RSM_PTR_RSM_WR_PTR_MASK)

#define XCVR_MISC_RSM_PTR_RSM_WR_PAGE_MASK       (0x10000000U)
#define XCVR_MISC_RSM_PTR_RSM_WR_PAGE_SHIFT      (28U)
/*! RSM_WR_PAGE - RSM RESULT WRITE PAGE */
#define XCVR_MISC_RSM_PTR_RSM_WR_PAGE(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RSM_PTR_RSM_WR_PAGE_SHIFT)) & XCVR_MISC_RSM_PTR_RSM_WR_PAGE_MASK)
/*! @} */

/*! @name RADIO2HOST - Radio to Host Buffer */
/*! @{ */

#define XCVR_MISC_RADIO2HOST_RADIO2HOST_DATA_MASK (0xFFFFU)
#define XCVR_MISC_RADIO2HOST_RADIO2HOST_DATA_SHIFT (0U)
/*! RADIO2HOST_DATA - Data of Buffer0 */
#define XCVR_MISC_RADIO2HOST_RADIO2HOST_DATA(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_RADIO2HOST_RADIO2HOST_DATA_SHIFT)) & XCVR_MISC_RADIO2HOST_RADIO2HOST_DATA_MASK)
/*! @} */

/*! @name HOST2RADIO - Host to Radio Buffer */
/*! @{ */

#define XCVR_MISC_HOST2RADIO_HOST2RADIO_DATA_MASK (0xFFFFU)
#define XCVR_MISC_HOST2RADIO_HOST2RADIO_DATA_SHIFT (0U)
/*! HOST2RADIO_DATA - Data of Buffer0 */
#define XCVR_MISC_HOST2RADIO_HOST2RADIO_DATA(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_HOST2RADIO_HOST2RADIO_DATA_SHIFT)) & XCVR_MISC_HOST2RADIO_HOST2RADIO_DATA_MASK)
/*! @} */

/*! @name COEX_CHANNEL0 - skip coex rf_denied for channel 0 to 31 */
/*! @{ */

#define XCVR_MISC_COEX_CHANNEL0_COEX_0_31_MASK   (0xFFFFFFFFU)
#define XCVR_MISC_COEX_CHANNEL0_COEX_0_31_SHIFT  (0U)
/*! COEX_0_31 - Coexistence Allowed Channel Table0 */
#define XCVR_MISC_COEX_CHANNEL0_COEX_0_31(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_CHANNEL0_COEX_0_31_SHIFT)) & XCVR_MISC_COEX_CHANNEL0_COEX_0_31_MASK)
/*! @} */

/*! @name COEX_CHANNEL1 - skip coex rf_denied for channel 32 to 63 */
/*! @{ */

#define XCVR_MISC_COEX_CHANNEL1_COEX_32_63_MASK  (0xFFFFFFFFU)
#define XCVR_MISC_COEX_CHANNEL1_COEX_32_63_SHIFT (0U)
/*! COEX_32_63 - Coexistence Allowed Channel Table1 */
#define XCVR_MISC_COEX_CHANNEL1_COEX_32_63(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_CHANNEL1_COEX_32_63_SHIFT)) & XCVR_MISC_COEX_CHANNEL1_COEX_32_63_MASK)
/*! @} */

/*! @name COEX_CHANNEL2 - skip coex rf_denied for channel 64 to 95 */
/*! @{ */

#define XCVR_MISC_COEX_CHANNEL2_COEX_64_95_MASK  (0xFFFFFFFFU)
#define XCVR_MISC_COEX_CHANNEL2_COEX_64_95_SHIFT (0U)
/*! COEX_64_95 - Coexistence Allowed Channel Table2 */
#define XCVR_MISC_COEX_CHANNEL2_COEX_64_95(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_CHANNEL2_COEX_64_95_SHIFT)) & XCVR_MISC_COEX_CHANNEL2_COEX_64_95_MASK)
/*! @} */

/*! @name COEX_CHANNEL3 - skip coex rf_denied for channel 96 to 127 */
/*! @{ */

#define XCVR_MISC_COEX_CHANNEL3_COEX_96_127_MASK (0xFFFFFFFFU)
#define XCVR_MISC_COEX_CHANNEL3_COEX_96_127_SHIFT (0U)
/*! COEX_96_127 - Coexistence Allowed Channel Table3 */
#define XCVR_MISC_COEX_CHANNEL3_COEX_96_127(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_CHANNEL3_COEX_96_127_SHIFT)) & XCVR_MISC_COEX_CHANNEL3_COEX_96_127_MASK)
/*! @} */

/*! @name COEX_MODE - Coexistence mode */
/*! @{ */

#define XCVR_MISC_COEX_MODE_COEX_BLE_EARLY_EVENT_MASK (0x1U)
#define XCVR_MISC_COEX_MODE_COEX_BLE_EARLY_EVENT_SHIFT (0U)
/*! COEX_BLE_EARLY_EVENT - Coexistence early start btle enable */
#define XCVR_MISC_COEX_MODE_COEX_BLE_EARLY_EVENT(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_MODE_COEX_BLE_EARLY_EVENT_SHIFT)) & XCVR_MISC_COEX_MODE_COEX_BLE_EARLY_EVENT_MASK)

#define XCVR_MISC_COEX_MODE_COEX_DUALPRIO_MASK   (0x6U)
#define XCVR_MISC_COEX_MODE_COEX_DUALPRIO_SHIFT  (1U)
/*! COEX_DUALPRIO - Coexistence dual priority */
#define XCVR_MISC_COEX_MODE_COEX_DUALPRIO(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_MODE_COEX_DUALPRIO_SHIFT)) & XCVR_MISC_COEX_MODE_COEX_DUALPRIO_MASK)

#define XCVR_MISC_COEX_MODE_COEX_PRIO1_SW_MASK   (0x18U)
#define XCVR_MISC_COEX_MODE_COEX_PRIO1_SW_SHIFT  (3U)
/*! COEX_PRIO1_SW - Coexistence dual priority */
#define XCVR_MISC_COEX_MODE_COEX_PRIO1_SW(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_MODE_COEX_PRIO1_SW_SHIFT)) & XCVR_MISC_COEX_MODE_COEX_PRIO1_SW_MASK)

#define XCVR_MISC_COEX_MODE_COEX_CS_EN_MASK      (0x20U)
#define XCVR_MISC_COEX_MODE_COEX_CS_EN_SHIFT     (5U)
/*! COEX_CS_EN - Coexistence cs rf_deny enable */
#define XCVR_MISC_COEX_MODE_COEX_CS_EN(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_MODE_COEX_CS_EN_SHIFT)) & XCVR_MISC_COEX_MODE_COEX_CS_EN_MASK)

#define XCVR_MISC_COEX_MODE_COEX_CS_DUALREQ_MASK (0x40U)
#define XCVR_MISC_COEX_MODE_COEX_CS_DUALREQ_SHIFT (6U)
/*! COEX_CS_DUALREQ - Coexistence cs dual req mode */
#define XCVR_MISC_COEX_MODE_COEX_CS_DUALREQ(x)   (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_MODE_COEX_CS_DUALREQ_SHIFT)) & XCVR_MISC_COEX_MODE_COEX_CS_DUALREQ_MASK)

#define XCVR_MISC_COEX_MODE_COEX_CS_DUALPHASE_MASK (0x80U)
#define XCVR_MISC_COEX_MODE_COEX_CS_DUALPHASE_SHIFT (7U)
/*! COEX_CS_DUALPHASE - Coexistence cs dual phase mode */
#define XCVR_MISC_COEX_MODE_COEX_CS_DUALPHASE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_MODE_COEX_CS_DUALPHASE_SHIFT)) & XCVR_MISC_COEX_MODE_COEX_CS_DUALPHASE_MASK)

#define XCVR_MISC_COEX_MODE_COEX_ALLOW_CHANNEL_EN_MASK (0x100U)
#define XCVR_MISC_COEX_MODE_COEX_ALLOW_CHANNEL_EN_SHIFT (8U)
/*! COEX_ALLOW_CHANNEL_EN - Coexistence allow channel enable */
#define XCVR_MISC_COEX_MODE_COEX_ALLOW_CHANNEL_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_MODE_COEX_ALLOW_CHANNEL_EN_SHIFT)) & XCVR_MISC_COEX_MODE_COEX_ALLOW_CHANNEL_EN_MASK)

#define XCVR_MISC_COEX_MODE_COEX_CONFLICT_CHANNEL_EN_MASK (0x200U)
#define XCVR_MISC_COEX_MODE_COEX_CONFLICT_CHANNEL_EN_SHIFT (9U)
/*! COEX_CONFLICT_CHANNEL_EN - Coexistence conflict channel enable */
#define XCVR_MISC_COEX_MODE_COEX_CONFLICT_CHANNEL_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_MODE_COEX_CONFLICT_CHANNEL_EN_SHIFT)) & XCVR_MISC_COEX_MODE_COEX_CONFLICT_CHANNEL_EN_MASK)
/*! @} */

/*! @name COEX_STATUS - Coexistence status */
/*! @{ */

#define XCVR_MISC_COEX_STATUS_COEX_STATUS_MASK   (0xFU)
#define XCVR_MISC_COEX_STATUS_COEX_STATUS_SHIFT  (0U)
/*! COEX_STATUS - Coexistence status */
#define XCVR_MISC_COEX_STATUS_COEX_STATUS(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_COEX_STATUS_COEX_STATUS_SHIFT)) & XCVR_MISC_COEX_STATUS_COEX_STATUS_MASK)
/*! @} */

/*! @name MISC_INT_STATUS - Interrupt status for all coex and dma sources */
/*! @{ */

#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_IPS_WR_XFR_ERR_MASK (0x1U)
#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_IPS_WR_XFR_ERR_SHIFT (0U)
/*! XCVR_IRQ_IPS_WR_XFR_ERR - XCVR_IRQ_IPS_WR_XFR_ERR */
#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_IPS_WR_XFR_ERR(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_IPS_WR_XFR_ERR_SHIFT)) & XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_IPS_WR_XFR_ERR_MASK)

#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_DMA_LITE_END_MASK (0x2U)
#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_DMA_LITE_END_SHIFT (1U)
/*! XCVR_IRQ_DMA_LITE_END - XCVR_IRQ_DMA_LITE_END */
#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_DMA_LITE_END(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_DMA_LITE_END_SHIFT)) & XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_DMA_LITE_END_MASK)

