zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_MISC.h
#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_BTA_MASK (0x4U)
#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_BTA_SHIFT (2U)
/*! XCVR_IRQ_RF_DENY_BTA - XCVR_IRQ_RF_DENY_BTA */
#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_BTA(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_BTA_SHIFT)) & XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_BTA_MASK)

#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_FALL_MASK (0x8U)
#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_FALL_SHIFT (3U)
/*! XCVR_IRQ_RF_DENY_FALL - RSM_IRQ_RF_DENY_FALL */
#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_FALL(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_FALL_SHIFT)) & XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_FALL_MASK)

#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_RISE_MASK (0x10U)
#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_RISE_SHIFT (4U)
/*! XCVR_IRQ_RF_DENY_RISE - RSM_IRQ_RF_DENY_RISE */
#define XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_RISE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_RISE_SHIFT)) & XCVR_MISC_MISC_INT_STATUS_XCVR_IRQ_RF_DENY_RISE_MASK)
/*! @} */

/*! @name MISC_INT_ENABLE - Interrupt enable for all coex and dma sources */
/*! @{ */

#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_IPS_WR_XFR_ERR_EN_MASK (0x1U)
#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_IPS_WR_XFR_ERR_EN_SHIFT (0U)
/*! XCVR_IRQ_IPS_WR_XFR_ERR_EN - XCVR_IRQ_IPS_WR_XFR_ERR_EN */
#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_IPS_WR_XFR_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_IPS_WR_XFR_ERR_EN_SHIFT)) & XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_IPS_WR_XFR_ERR_EN_MASK)

#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_DMA_LITE_END_EN_MASK (0x2U)
#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_DMA_LITE_END_EN_SHIFT (1U)
/*! XCVR_IRQ_DMA_LITE_END_EN - XCVR_IRQ_DMA_LITE_END_EN */
#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_DMA_LITE_END_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_DMA_LITE_END_EN_SHIFT)) & XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_DMA_LITE_END_EN_MASK)

#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_BTA_EN_MASK (0x4U)
#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_BTA_EN_SHIFT (2U)
/*! XCVR_IRQ_RF_DENY_BTA_EN - XCVR_IRQ_RF_DENY_BTA_EN */
#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_BTA_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_BTA_EN_SHIFT)) & XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_BTA_EN_MASK)

#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_FALL_EN_MASK (0x8U)
#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_FALL_EN_SHIFT (3U)
/*! XCVR_IRQ_RF_DENY_FALL_EN - XCVR_IRQ_RF_DENY_FALL_EN */
#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_FALL_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_FALL_EN_SHIFT)) & XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_FALL_EN_MASK)

#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_RISE_EN_MASK (0x10U)
#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_RISE_EN_SHIFT (4U)
/*! XCVR_IRQ_RF_DENY_RISE_EN - XCVR_IRQ_RF_DENY_RISE_EN */
#define XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_RISE_EN(x) (((uint32_t)(((uint32_t)(x)) << XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_RISE_EN_SHIFT)) & XCVR_MISC_MISC_INT_ENABLE_XCVR_IRQ_RF_DENY_RISE_EN_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group XCVR_MISC_Register_Masks */


/*!
 * @}
 */ /* end of group XCVR_MISC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_XCVR_MISC_H_ */

